src/Reports/ИС_WB_ЛиквидностьТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ИС_WB_ЛиквидностьТоваровНаСкладах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/ИС_WB_ЛиквидностьТоваровНаСкладах/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИС_WB_Сервер.ПриСозданииНаСервере(ЭтотОбъект);	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	УстрановитьОтборПоПрофилю();
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура УстрановитьОтборПоПрофилю()	
	Отчет.Профиль = Профиль;  	
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Отчет.ДатаНачала = ДатаНачала;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

//+ ИнфоСофт Сумин Д.В. 20.07.23 УА #60317
&НаКлиенте
Процедура ДатаоОкончанияПриИзменении(Элемент)
	Отчет.ДатаОкончания = ДатаОкончания;
КонецПроцедуры //- ИнфоСофт Сумин Д.В. 20.07.23 УА #60317

#КонецОбласти
